# fmt: off
#
#   В Т П Н *   * Й П Л Т Х
#   С К З Р *   * Р С К В З
#
#         А О   Е Ъ
#
KEYS = (
    '#',
    'В-', 'С-', 'Т-', 'К-', 'П-', 'З-', 'Н-', 'Р-',
    'А-', 'О-',
    '*',
    '-Е', '-Ъ',
    '-Й', '-Р', '-П', '-С', '-Л', '-К', '-Т', '-В', '-Х', '-З',
)
# fmt: on

IMPLICIT_HYPHEN_KEYS = ('А-', 'О-', '-Е', '-Ъ', '*')
SUFFIX_KEYS = ()
NUMBER_KEY = None
NUMBERS = {}
FERAL_NUMBER_KEY = False

UNDO_STROKE_STENO = "*"

ORTHOGRAPHY_RULES = []
ORTHOGRAPHY_RULES_ALIASES = {}
ORTHOGRAPHY_WORDLIST = None

KEYMAPS = {
    'Gemini PR': {
        '#'         : ('#1', '#2', '#3', '#4', '#5', '#6', '#7', '#8', '#9', '#A', '#B', '#C'),
        'В-'        : 'S1-',
        'С-'        : 'S2-',
        'Т-'        : 'T-',
        'К-'        : 'K-',
        'П-'        : 'P-',
        'З-'        : 'W-',
        'Н-'        : 'H-',
        'Р-'        : 'R-',
        'А-'        : 'A-',
        'О-'        : 'O-',
        '*'         : ('*1', '*2', '*3', '*4'),
        '-Е'        : '-E',
        '-Ъ'        : '-U',
        '-Й'        : '-F',
        '-Р'        : '-R',
        '-П'        : '-P',
        '-С'        : '-B',
        '-Л'        : '-L',
        '-К'        : '-G',
        '-Т'        : '-T',
        '-В'        : '-S',
        '-Х'        : '-D',
        '-З'        : '-Z',
        'no-op'     : ('Fn', 'pwr', 'res1', 'res2'),
    },
    'Keyboard': {
        '#'         : ('1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '='),
        'В-'        : 'q',
        'С-'        : 'a',
        'Т-'        : 'w',
        'К-'        : 's',
        'П-'        : 'e',
        'З-'        : 'd',
        'Н-'        : 'r',
        'Р-'        : 'f',
        'А-'        : 'c',
        'О-'        : 'v',
        '*'         : ('t', 'g', 'y', 'h'),
        '-Е'        : 'n',
        '-Ъ'        : 'm',
        '-Й'        : 'u',
        '-Р'        : 'j',
        '-П'        : 'i',
        '-С'        : 'k',
        '-Л'        : 'o',
        '-К'        : 'l',
        '-Т'        : 'p',
        '-В'        : ';',
        '-Х'        : '[',
        '-З'        : '\'',
        'no-op'     : ('z', 'x', 'b', ',', '.', '/', ']', '\\'),
    },
}
KEYMAPS["Plover HID"] = KEYMAPS["Gemini PR"]

DICTIONARIES_ROOT = None
DEFAULT_DICTIONARIES = ()
